# -----------
# Brew utilities
# -----------

tap "homebrew/core"
tap "homebrew/services"
tap "nikitabobko/tap"

# -----------
# InStride dependencies
# -----------

# Official Amazon AWS command-line interface
brew "awscli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Lightweight and flexible command-line JSON processor
brew "jq"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# GraphQL IDE for better development workflows
cask "graphql-playground"

# -----------
# Useful utilities
# -----------

# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line benchmarking tool
brew "hyperfine"
# Git-compatible distributed version control system
brew "jj"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
